# Задача №31. Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где a0 = 0, 
# a1 = 1, ak = ak-1 + ak-2 (k > 1). Требуется найти N-е число Фибоначчи

def Fibo(n):
    pass


# n = int(input('Введите число: '))
n = 8
print(Fibo(n))