# print('Вывод: ', 24, 45, 78, sep = " " ) # sep - задет разделитель между элементами вывода

# print('Вывод: ', 24, 45, 78, sep = "" )

# print('Вывод: ', 24, 45, 78, sep = ", " )

# print('Вывод: ', 24, 45, 78, sep = " & ", end='\n' ) # end='' - конец строки, \n - переход на новую строку.

# print('Вывод: ', 24, 45, 78, sep = " & ", end='' ) # Все в одну строку
# print('Вывод: ', 24, 45, 78)

# print('Вывод: ', 24, 45, 78, sep = " & ", end='*** ' ) # Все в одну строку c рзделителем ***
# print('Вывод: ', 24, 45, 78)

# print('Вывод: ', 24, 45, 78, sep = " & ", end='*** \n' ) # После *** перевод на новую строку
# print('Вывод: ', 24, 45, 78)

# print('Вывод: "Ковычки"') # Спооб вывести текст в ковычках

# print("Вывод: \"Ковычки\"") # Второй спооб вывести текст в ковычках

# print("Вывод: \"К \n      ов \n ыч \n ки") 

# print("Вывод: \t\t Ввод") # \t - табуляция или большой отступ или большой пробел

# print(5 + 5) # Можно выполнять мтематический действия

# print('Степень', 6 ** 3) # Возведение в степень
# print('Степень', pow(6, 3))

# print(8 / 3) # Деление
# print(8 // 3) # Выводит первое целое, убирает все после запятой
# print('Округляет', round(8 / 3)) # Округляет

# print('Мини элемент: ', min(3, -4, 7, -19, 56)) # Находит мин элемент

# print('Мини элемент: ', max(3, 4, 7, -19, 56)) # Находит max элемент

# print('Абсолютное значение', abs(-234))








