import math
a1 = math.pi; a2 = math.e  # Общие константы
c = math.sin(2 * math.pi / 180)  # Синус, тангенс, косинус
d1 = math.sqrt(144); d2 = math.sqrt(2)  # Квадратный корень
d3 = 144 ** 0.5; d4 = pow(144, 0.5) # Другой способ вычисления квадратного корня
e1 = pow(2, 4); e2 = 2 ** 4; e3 = 2.0 ** 4.0  # Возведение в степень
f = abs(-42.0)  # Абсолютное значение, суммирование
g = sum((1, 2, 3, 4))
q1 = min(3, 1, 2, 4); q2 = max(3, 1, 2, 4)  # Минимум, максимум

w1 = math.floor(2.567); w2 = math.floor(-2.567) # Округление в меньшую сторону (до меньшего целого)
r1 = math.trunc(2.567); r2 = math.trunc(-2.567) # Усечение (отбрасывание десятичных цифр)
t1 = int(2.567); t2 = int(-2.567) # Усечение (преобразованиев целое число)
y1 = round(2.567); y2 = round(2.467); y3 = round(2.567, 2) # Округление (версия Python З.Х)

print(d4)





